УчетВУправляющихДляГит1/src/InformationRegisters/ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда/ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда</name>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КлассУсловийТруда</name>
    <type>
      <types>EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/Enums/КлассыУсловийТрудаПоРезультатамСпециальнойОценки/КлассыУсловийТрудаПоРезультатамСпециальнойОценки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КлассыУсловийТрудаПоРезультатамСпециальнойОценки</name>
  <enumValues>
    <name>Опасный</name>
  </enumValues>
  <enumValues>
    <name>Вредный1</name>
  </enumValues>
  <enumValues>
    <name>Вредный2</name>
  </enumValues>
  <enumValues>
    <name>Вредный3</name>
  </enumValues>
  <enumValues>
    <name>Вредный4</name>
  </enumValues>
  <enumValues>
    <name>Допустимый</name>
  </enumValues>
  <enumValues>
    <name>Оптимальный</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/InformationRegisters/ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда();
	
КонецПроцедуры

Процедура ЗаполнитьТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда");
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		// Не добавляем записи, если регистр уже заполнен (из-за создания начального образа РИБ или АРМ, например).
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда.СоздатьНаборЗаписей();	
	НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
	
	Запись = НаборЗаписей.Добавить();
	Запись.КлассУсловийТруда = Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1;
	Запись.Тариф = 2;
	Запись = НаборЗаписей.Добавить();
	Запись.КлассУсловийТруда = Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2;
	Запись.Тариф = 4;
	Запись = НаборЗаписей.Добавить();
	Запись.КлассУсловийТруда = Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3;
	Запись.Тариф = 6;
	Запись = НаборЗаписей.Добавить();
	Запись.КлассУсловийТруда = Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4;
	Запись.Тариф = 7;
	Запись = НаборЗаписей.Добавить();
	Запись.КлассУсловийТруда = Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный;
	Запись.Тариф = 8;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
